# Clase 6 - Pandas

In [3]:
import numpy as np
import pandas as pd

In [5]:
data = pd.read_csv("titanic.csv")

# Ejercicios 

- Confirmar que la cantidad de pasajeros que se salvaron en proporción fue mayor en los casos de las Clase 1
     - Se confirma la consigna
- Confirmar que mujeres y niños ( < 10 años ) se salvaron mas que varones (en proporciones)
    - Se confirma la consigna
1. Sexo
2. Clase
3. Sobrevivieron o no
4. Edad

In [18]:
# 1.

clase1 = data.loc[(data["Pclass"] == 1) & (data["Survived"] == 1)]
clase2 = data.loc[(data["Pclass"] == 2) & (data["Survived"] == 1)]
clase3 = data.loc[(data["Pclass"] == 3) & (data["Survived"] == 1)]

In [24]:
data.loc[data["Pclass"]==1].count()

PassengerId    216
Survived       216
Pclass         216
Name           216
Sex            216
Age            186
SibSp          216
Parch          216
Ticket         216
Fare           216
Cabin          176
Embarked       214
dtype: int64

In [28]:
len(clase1)/216

0.6296296296296297

In [30]:
data.loc[data["Pclass"]==2].count()

PassengerId    184
Survived       184
Pclass         184
Name           184
Sex            184
Age            173
SibSp          184
Parch          184
Ticket         184
Fare           184
Cabin           16
Embarked       184
dtype: int64

In [32]:
len(clase2) / 184

0.47282608695652173

In [34]:
data.loc[data["Pclass"]==3].count()

PassengerId    491
Survived       491
Pclass         491
Name           491
Sex            491
Age            355
SibSp          491
Parch          491
Ticket         491
Fare           491
Cabin           12
Embarked       491
dtype: int64

In [36]:
len(clase3) / 491

0.24236252545824846

In [38]:
# 2.

myn = data.loc[(data["Sex"] == "female") | (data["Age"] < 10)]

In [40]:
vad = data.loc[(data["Sex"] == "male") & (data["Age"] >= 10)]

In [52]:
myn.count()

PassengerId    346
Survived       346
Pclass         346
Name           346
Sex            346
Age            293
SibSp          346
Parch          346
Ticket         346
Fare           346
Cabin          103
Embarked       344
dtype: int64

In [50]:
total_myn

PassengerId    346
Survived       346
Pclass         346
Name           346
Sex            346
Age            293
SibSp          346
Parch          346
Ticket         346
Fare           346
Cabin          103
Embarked       344
dtype: int64

In [44]:
vad.count()

PassengerId    421
Survived       421
Pclass         421
Name           421
Sex            421
Age            421
SibSp          421
Parch          421
Ticket         421
Fare           421
Cabin           89
Embarked       421
dtype: int64

In [54]:
myn[myn["Survived"] == 1].count()

PassengerId    252
Survived       252
Pclass         252
Name           252
Sex            252
Age            216
SibSp          252
Parch          252
Ticket         252
Fare           252
Cabin           97
Embarked       250
dtype: int64

In [56]:
252/346

0.7283236994219653

In [ ]:
vad[vad["Survived"] == 1].count()

In [60]:
74/421

0.17577197149643706

## Indices

In [67]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]])

In [69]:
df

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [71]:
df.index = ["Enero", "Febrero", "Marzo"]
df.columns = ["Año 2019", "Año 2020", "Año 2021", "Año 2022" ]

In [73]:
df

         Año 2019  Año 2020  Año 2021  Año 2022
Enero           1         2         3         4
Febrero         5         6         7         8
Marzo           9        10        11        12

In [75]:
df.index.values[1], df.index.values[2] = "Abril", "Agosto"

In [77]:
df

        Año 2019  Año 2020  Año 2021  Año 2022
Enero          1         2         3         4
Abril          5         6         7         8
Agosto         9        10        11        12

In [79]:
df.rename(index={"Agosto": "Septiembre"}, inplace=True)

In [81]:
df

            Año 2019  Año 2020  Año 2021  Año 2022
Enero              1         2         3         4
Abril              5         6         7         8
Septiembre         9        10        11        12

In [83]:
df.rename(index=str.upper, columns=lambda x:x.replace("Año 20", ""), inplace=True )

In [85]:
df

            19  20  21  22
ENERO        1   2   3   4
ABRIL        5   6   7   8
SEPTIEMBRE   9  10  11  12

## set_index()

In [88]:
df = pd.DataFrame({'month': [1, 4, 7, 10],
                   'year': [2012, 2014, 2013, 2014],
                   'sale': [55, 40, 84, 31]})

In [90]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

In [94]:
df.set_index(["month", "year"], inplace=True)

In [96]:
df

            sale
month year
1     2012    55
4     2014    40
7     2013    84
10    2014    31

In [98]:
df.reset_index(inplace=True)

In [100]:
df

   month  year  sale
0      1  2012    55
1      4  2014    40
2      7  2013    84
3     10  2014    31

## drop rows & columns

In [103]:
invoices = {'invoice': [1, 2, 3, 4, 5, 6,7],
            'client': [4, 1, 3, 1, 2, 6,7],
            'units': [3, 2, 1, 2, 1, 1,4],
            'price': [27.76, 21.13, 29.82, 29.96, 21.11, 23.97, 25.22],
            'total': [83.28, 42.26, 29.82, 59.92, 21.11, 23.97, 100.88]}

In [107]:
invoices= pd.DataFrame(invoices)

In [109]:
invoices

   invoice  client  units  price   total
0        1       4      3  27.76   83.28
1        2       1      2  21.13   42.26
2        3       3      1  29.82   29.82
3        4       1      2  29.96   59.92
4        5       2      1  21.11   21.11
5        6       6      1  23.97   23.97
6        7       7      4  25.22  100.88

In [111]:
invoices.drop(["client"], axis=1, inplace=True)

In [113]:
invoices

   invoice  units  price   total
0        1      3  27.76   83.28
1        2      2  21.13   42.26
2        3      1  29.82   29.82
3        4      2  29.96   59.92
4        5      1  21.11   21.11
5        6      1  23.97   23.97
6        7      4  25.22  100.88

In [115]:
invoices.drop([3,5], axis=0, inplace=True)

In [117]:
invoices

   invoice  units  price   total
0        1      3  27.76   83.28
1        2      2  21.13   42.26
2        3      1  29.82   29.82
4        5      1  21.11   21.11
6        7      4  25.22  100.88

## reindex

In [120]:
index = ['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror']
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                  'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                  index=index)

In [122]:
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [124]:
new_index = ["Safari", "Konqueror", "IE10", "Firefox", "Chrome"]

In [126]:
df.reindex(new_index)

           http_status  response_time
Safari             404           0.07
Konqueror          301           1.00
IE10               404           0.08
Firefox            200           0.04
Chrome             200           0.02

In [128]:
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [130]:
new_index = ["Safari", "Iceweseal", "Comodo", "IE10", "Chrome"]

In [134]:
df.reindex(new_index, fill_value=0)

           http_status  response_time
Safari             404           0.07
Iceweseal            0           0.00
Comodo               0           0.00
IE10               404           0.08
Chrome             200           0.02

## Operaciones

In [137]:
s1 = pd.Series([8,6,3,4,5], index=[0,1,2,3,4])
s2 = pd.Series([1,5,2,3,5], index=[0,1,2,5,6])

In [139]:
s1

0    8
1    6
2    3
3    4
4    5
dtype: int64

In [141]:
s2

0    1
1    5
2    2
5    3
6    5
dtype: int64

In [143]:
s1 + s2

0     9.0
1    11.0
2     5.0
3     NaN
4     NaN
5     NaN
6     NaN
dtype: float64

In [145]:
df1 = pd.DataFrame({"A":[8,4,2,6,7,8],"B":[8,4,2,6,7,8], "C":[8,4,2,6,7,8], "D":[8,4,2,6,7,8]})
df2 = pd.DataFrame({"B":[7,8,9,1,2,0],"A":[1,2,3,4,5,6],  "C":[1,2,3,4,5,6], "D":[2,3,4,5,6,7], "E":[2,3,4,5,6,7]})

In [147]:
df1

   A  B  C  D
0  8  8  8  8
1  4  4  4  4
2  2  2  2  2
3  6  6  6  6
4  7  7  7  7
5  8  8  8  8

In [149]:
df2

   B  A  C  D  E
0  7  1  1  2  2
1  8  2  2  3  3
2  9  3  3  4  4
3  1  4  4  5  5
4  2  5  5  6  6
5  0  6  6  7  7

In [151]:
df1 + df2

    A   B   C   D   E
0   9  15   9  10 NaN
1   6  12   6   7 NaN
2   5  11   5   6 NaN
3  10   7  10  11 NaN
4  12   9  12  13 NaN
5  14   8  14  15 NaN

In [155]:
df1["F"] = df1["A"] + df1["B"]

In [157]:
df1

   A  B  C  D   F
0  8  8  8  8  16
1  4  4  4  4   8
2  2  2  2  2   4
3  6  6  6  6  12
4  7  7  7  7  14
5  8  8  8  8  16

## Estadísticas

In [160]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [164]:
data["Age"].mean()

29.69911764705882

In [166]:
data["Age"].std()

14.526497332334044

In [168]:
data["Age"].median()

28.0

In [170]:
data["Age"].mode()

0    24.0
Name: Age, dtype: float64

In [172]:
data["Age"].max()

80.0

In [174]:
data["Age"].min()

0.42

In [176]:
data[data["Age"] < 1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
305,306,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
831,832,1,2,"Richards, Master. George Sibley",male,0.83,1,1,29106,18.7500,NaN,S

In [178]:
9/12

0.75

In [180]:
10/12

0.8333333333333334

In [182]:
11/12

0.9166666666666666

In [186]:
data.loc[data["Age"]<1, ["Name", "Age"]].count()

Name    7
Age     7
dtype: int64

In [188]:
data["Sex"].count()

891

In [190]:
data.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [192]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [194]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [196]:
data.describe(exclude=[np.number])

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [200]:
data[data["Ticket"] == "347082"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.275,NaN,S
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.0,4,2,347082,31.275,NaN,S
541,542,0,3,"Andersson, Miss. Ingeborg Constanzia",female,9.0,4,2,347082,31.275,NaN,S
542,543,0,3,"Andersson, Miss. Sigrid Elisabeth",female,11.0,4,2,347082,31.275,NaN,S
610,611,0,3,"Andersson, Mrs. Anders Johan (Alfrida Konstant...",female,39.0,1,5,347082,31.275,NaN,S
813,814,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.0,4,2,347082,31.275,NaN,S
850,851,0,3,"Andersson, Master. Sigvard Harald Elias",male,4.0,4,2,347082,31.275,NaN,S

In [202]:
data.describe(include="all")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [206]:
data.describe(percentiles=[.1,.2,.3,.4,.5,.6,.7,.8,.9,.95,.98] )

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
10%,90.000000,0.000000,1.000000,14.000000,0.000000,0.000000,7.550000
20%,179.000000,0.000000,1.000000,19.000000,0.000000,0.000000,7.854200
30%,268.000000,0.000000,2.000000,22.000000,0.000000,0.000000,8.050000
40%,357.000000,0.000000,2.000000,25.000000,0.000000,0.000000,10.500000
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
60%,535.000000,0.000000,3.000000,31.800000,0.000000,0.000000,21.679200
70%,624.000000,1.000000,3.000000,36.000000,1.000000,0.000000,27.000000
80%,713.000000,1.000000,3.000000,41.000000,1.000000,1.000000,39.687500
90%,802.000000,1.000000,3.000000,50.000000,1.000000,2.000000,77.958300
95%,846.500000,1.000000,3.000000,56.000000,3.000000,2.000000,112.079150
98%,873.200000,1.000000,3.000000,62.740000,4.000000,2.000000,211.337500
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [214]:
(data["Age"].isna()).sum()

177

In [216]:
891-177

714

## aggregate()

In [220]:
data.select_dtypes("number").aggregate(["sum", "mean", "max", "min", "count"])

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
sum,397386.0,342.000000,2057.000000,21205.170000,466.000000,340.000000,28693.949300
mean,446.0,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
max,891.0,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200
min,1.0,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
count,891.0,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000

In [222]:
data.select_dtypes("number").agg({"Survived":np.sum, "Age":np.mean})

C:\Users\Norman Beltran\AppData\Local\Temp\ipykernel_13040\4022309304.py:1: FutureWarning: The provided callable <function sum at 0x0000019453F95300> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  data.select_dtypes("number").agg({"Survived":np.sum, "Age":np.mean})
C:\Users\Norman Beltran\AppData\Local\Temp\ipykernel_13040\4022309304.py:1: FutureWarning: The provided callable <function mean at 0x0000019453F963E0> is currently using Series.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  data.select_dtypes("number").agg({"Survived":np.sum, "Age":np.mean})

Survived    342.000000
Age          29.699118
dtype: float64

In [226]:
data.select_dtypes("number").agg({"Age": ["min", "max", "mean"]})

            Age
min    0.420000
max   80.000000
mean  29.699118

## value_counts()

In [229]:
df = pd.DataFrame({'num_patas': [2, 4, 4, 6, 4, 2],
                   'num_alas': [2, 0, 0, 0, 0, 2]},
                  index=['halcon', 'perro', 'gato', 'hormiga', 'caballo', 'loro'])

In [231]:
df

         num_patas  num_alas
halcon           2         2
perro            4         0
gato             4         0
hormiga          6         0
caballo          4         0
loro             2         2

In [233]:
df.value_counts()

num_patas  num_alas
4          0           3
2          2           2
6          0           1
Name: count, dtype: int64

In [235]:
df.value_counts(ascending=True)

num_patas  num_alas
6          0           1
2          2           2
4          0           3
Name: count, dtype: int64

In [237]:
df.value_counts(normalize=True)

num_patas  num_alas
4          0           0.500000
2          2           0.333333
6          0           0.166667
Name: proportion, dtype: float64